Revit 2024 API
Document.NewSpaces2 Method (Level, Phase, View)
 Creates new spaces on the available plan circuits of a the given level.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ICollection<ElementId> NewSpaces2(
	Level level,
	Phase phase,
	View view
)
Visual Basic
Public Function NewSpaces2 ( _
	level As Level, _
	phase As Phase, _
	view As View _
) As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ NewSpaces2(
	Level^ level,
	Phase^ phase,
	View^ view
)
Parameters
level
Type: Autodesk.Revit.DB.Level
 The level on which the spaces is to exist.
phase
Type: Autodesk.Revit.DB.Phase
 The phase in which the spaces is to exist.
view
Type: Autodesk.Revit.DB.View
 The view on which the space tags for the spaces are to display.
Return Value
 If successful, a set of ElementIds which contains the rooms should be returned, otherwise the exception will be thrown.
Remarks
 This method will regenerate the document even in manual regeneration mode.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException | The view of the relevant level can not be retrieved.
Autodesk.Revit.Exceptions.InvalidOperationException | The phase is invalid or regeneration fails at the end of the creation.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the level does not exist in the given document.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the phase does not exist in the given document.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the view does not exist in the given document.
See Also
Document Class
NewSpaces2 Overload
Autodesk.Revit.Creation Namespace